-----------------------------------------------------------------------------------------------------------------------------------------
-- VRP
-----------------------------------------------------------------------------------------------------------------------------------------
local Proxy = module("vrp","lib/Proxy")
vRP = Proxy.getInterface("vRP")
-----------------------------------------------------------------------------------------------------------------------------------------
-- VARIABLES
-----------------------------------------------------------------------------------------------------------------------------------------
local Boxes = 0
local Selected = false
local Cooldown = os.time()
-----------------------------------------------------------------------------------------------------------------------------------------
-- TIMERS
-----------------------------------------------------------------------------------------------------------------------------------------
local Timers = {}
-----------------------------------------------------------------------------------------------------------------------------------------
-- COMPONETS
-----------------------------------------------------------------------------------------------------------------------------------------
local Components = {
	{
		["Objects"] = {
			["1"] = { 2611.75,4476.32,37.69,0.0,"prop_crashed_heli" },
			["2"] = { 2616.68,4472.48,37.96,218.27,"prop_mil_crate_01" },
			["3"] = { 2605.93,4468.87,38.33,127.56,"prop_mil_crate_01" },
			["4"] = { 2605.56,4481.69,37.39,8.51,"prop_mil_crate_01" }
		}
	}
}
-----------------------------------------------------------------------------------------------------------------------------------------
-- LOOTS
-----------------------------------------------------------------------------------------------------------------------------------------
local Loots = {
	{
		["1"] = { item = "syringe", amount = 1 },
		["2"] = { item = "syringe", amount = 2 },
		["3"] = { item = "syringe", amount = 3 },
		["4"] = { item = "syringe", amount = 4 },
		["5"] = { item = "syringe", amount = 5 }
	},{
		["1"] = { item = "syringe", amount = 1 },
		["2"] = { item = "syringe", amount = 2 },
		["3"] = { item = "syringe", amount = 3 },
		["4"] = { item = "syringe", amount = 4 },
		["5"] = { item = "syringe", amount = 5 }
	}
}
-----------------------------------------------------------------------------------------------------------------------------------------
-- SYSTEM
-----------------------------------------------------------------------------------------------------------------------------------------
CreateThread(function()
	while true do
		if Timers[os.date("%H:%M")] and os.time() >= Cooldown then
			Boxes = 0
			Selected = math.random(#Components)
			local Crashed = Components[Selected]

			for Number,v in pairs(Crashed["Objects"]) do
				if Number ~= "1" then
					Boxes = Boxes + 1

					local Loot = math.random(#Loots)
					vRP.RemSrvData("stackChest:Helicrash"..Number,false)
					vRP.SetSrvData("stackChest:Helicrash"..Number,Loots[Loot],false)
				end
			end

			TriggerClientEvent("Notify",-1,"amarelo","Mayday! Mayday! Tivemos problemas técnicos em nossos motores e estamos em queda livre.",30000)
			TriggerClientEvent("helicrash:Active",-1,Selected)
			Cooldown = os.time() + 3600
		end

		Wait(1000)
	end
end)
-----------------------------------------------------------------------------------------------------------------------------------------
-- HELICRASH:AMOUNTBOXES
-----------------------------------------------------------------------------------------------------------------------------------------
RegisterServerEvent("helicrash:AmountBoxes")
AddEventHandler("helicrash:AmountBoxes",function()
	Boxes = Boxes - 1

	if Boxes <= 0 then
		TriggerClientEvent("helicrash:ClearEvent",-1)
		Selected = false
		Boxes = 0
	end
end)
-----------------------------------------------------------------------------------------------------------------------------------------
-- CONNECT
-----------------------------------------------------------------------------------------------------------------------------------------
AddEventHandler("Connect",function(Passport,source)
	TriggerClientEvent("helicrash:Table",source,Components,Selected)
end)