------------------------------ 𝗧𝗶𝗽 𝟭 ---------------------------------
---------- 𝗪𝗵𝗶𝘁𝗲𝗟𝗶𝘀𝘁 𝗼𝗻𝗹𝘆 𝗳𝗼𝗿 𝘄𝗵𝗶𝘁𝗲𝗹𝗶𝘀𝘁 𝗽𝗹𝗮𝘆𝗲𝗿 (𝗻𝗼 𝗮𝗱𝗺𝗶𝗻 𝗺𝗲𝗻𝘂) ----------
------------------------------ 𝗧𝗶𝗽 𝟮 ---------------------------------
------------ 𝗔𝗱𝗺𝗶𝗻𝗠𝗲𝗻𝘂 𝗼𝗻𝗹𝘆 𝗳𝗼𝗿 𝗮𝗱𝗺𝗶𝗻'𝘀 (𝘄𝗵𝗶𝘁𝗲𝗹𝗶𝘀𝘁 + 𝗺𝗲𝗻𝘂) ------------
----------------------------------------------------------------------
WhiteList = {
    '7835767148521717**',                                -- Discord ID
    'steam:1100001476d05**',                             -- Steam Hex
    '192.168.1.**',                                      -- IP Address
    'license2:500a67097ce3c274569c773bc41974d3c28380**', -- FiveM License

}

AdminMenu = {
    '7835767148521717**',                                -- Discord ID
    'steam:1100001476d05**',                             -- Steam Hex
    '192.168.1.**',                                      -- IP Address
    'license2:500a67097ce3c274569c773bc41974d3c28380**', -- FiveM License
}